<!doctype html>
<html class="theme-next   use-motion ">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.4.5.2" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="毕设,流水账," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.4.5.2" />






<meta name="description" content="&amp;#x867D;&amp;#x7136;&amp;#x8001;&amp;#x5B8B;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x6BD5;&amp;#x8BBE;&amp;#x7EC4;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x5F00;&amp;#x4F1A;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C31;&amp;#x8BB2;&amp;#x4E86;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC4;&amp;#x975E;">
<meta property="og:type" content="article">
<meta property="og:title" content="记毕设开题">
<meta property="og:url" content="http://yoursite.com/2016/03/12/记毕设开题/index.html">
<meta property="og:site_name" content="My Blog">
<meta property="og:description" content="&amp;#x867D;&amp;#x7136;&amp;#x8001;&amp;#x5B8B;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x6BD5;&amp;#x8BBE;&amp;#x7EC4;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x5F00;&amp;#x4F1A;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C31;&amp;#x8BB2;&amp;#x4E86;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC4;&amp;#x975E;">
<meta property="og:updated_time" content="2016-03-12T08:05:30.435Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="记毕设开题">
<meta name="twitter:description" content="&amp;#x867D;&amp;#x7136;&amp;#x8001;&amp;#x5B8B;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x6BD5;&amp;#x8BBE;&amp;#x7EC4;&amp;#x7B2C;&amp;#x4E00;&amp;#x6B21;&amp;#x5F00;&amp;#x4F1A;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C31;&amp;#x8BB2;&amp;#x4E86;&amp;#x6211;&amp;#x4EEC;&amp;#x7EC4;&amp;#x975E;">



<script type="text/javascript" id="hexo.configuration">
  var CONFIG = {
    scheme: 'Mist',
    sidebar: 'always',
    motion: true
  };
</script>

  <title> 记毕设开题 | My Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  <!--[if lte IE 8]>
  <div style=' clear: both; height: 59px; padding:0 0 0 15px; position: relative;margin:0 auto;'>
    <a href="http://windows.microsoft.com/en-US/internet-explorer/products/ie/home?ocid=ie6_countdown_bannercode">
      <img src="http://7u2nvr.com1.z0.glb.clouddn.com/picouterie.jpg" border="0" height="42" width="820"
           alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today or use other browser ,like chrome firefox safari."
           style='margin-left:auto;margin-right:auto;display: block;'/>
    </a>
  </div>
<![endif]-->
  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e2cf033f430366884a7f6855e095fa8a";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <div class="container one-column page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">My Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Walk steps step by step</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu menu-left">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-guestbook">
          <a href="/guestbook" rel="section">
            
              <i class="menu-item-icon fa fa-question-circle fa-fw"></i> <br />
            
            留言
          </a>
        </li>
      

      
      
    </ul>
  

  
    <div class="site-search">
      
  
  <form class="site-search-form">
    <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
  </form>


<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'WSxrm3jXEy4o7v-t9_Bo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div id="content" class="content">
          

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                记毕设开题
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            发表于
            <time itemprop="dateCreated" datetime="2016-03-12T13:37:10+08:00" content="2016-03-12">
              2016-03-12
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp; 分类于
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/与技术无关/" itemprop="url" rel="index">
                    <span itemprop="name">与技术无关</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/03/12/记毕设开题/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/03/12/记毕设开题/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

        </div>
      </header>
    


    <div class="post-body">

      
      

      
        <span itemprop="articleBody"><p><strong>&#x867D;&#x7136;&#x8001;&#x5B8B;&#x5728;&#x6211;&#x4EEC;&#x6BD5;&#x8BBE;&#x7EC4;&#x7B2C;&#x4E00;&#x6B21;&#x5F00;&#x4F1A;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8BB2;&#x4E86;&#x6211;&#x4EEC;&#x7EC4;&#x975E;&#x5E38;&#x4E25;&#x683C;&#xFF0C;&#x4F46;&#x662F;&#x5F00;&#x9898;&#x7B54;&#x8FA9;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x5413;&#x5230;&#x6211;&#x4E86;&#x3002;</strong><br><strong><font size="4">&#x9996;&#x5148;&#x662F;&#x5F00;&#x9898;&#x7B54;&#x8FA9;&#x524D;&#xFF0C;</font></strong>&#x6211;&#x628A;&#x6211;&#x5199;&#x7684;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x53D1;&#x7ED9;&#x6211;&#x7684;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#xFF0C;&#x8001;&#x5B8B;&#x8BFE;&#x9898;&#x7EC4;&#x7684;&#x9EC4;&#x8001;&#x5E08;&#x8FC7;&#x76EE;&#x3002;&#x8001;&#x9EC4;&#x770B;&#x5B8C;&#x540E;&#x9A6C;&#x4E0A;&#x6253;&#x4E86;&#x4E2A;&#x7535;&#x8BDD;&#x7ED9;&#x6211;&#xFF0C;&#x544A;&#x8BC9;&#x6211;&#x8FD9;&#x6837;&#x5199;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF0C;&#x5F00;&#x9898;&#x4E0D;&#x4F1A;&#x8FC7;&#x7684;&#x3002;&#x5F00;&#x59CB;&#x6211;&#x8FD8;&#x6CA1;&#x592A;&#x5728;&#x610F;&#xFF0C;&#x4EE5;&#x4E3A;&#x8001;&#x9EC4;&#x5413;&#x552C;&#x6211;&#x3002;&#x7ED3;&#x679C;&#x8001;&#x9EC4;&#x5728;&#x7535;&#x8BDD;&#x91CC;&#x7ED9;&#x6211;&#x5217;&#x51FA;&#x4E86;&#x4E00;&#x5806;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5413;&#x5F97;&#x6211;&#x8D76;&#x7D27;&#x95EE;&#x4ED6;&#x600E;&#x4E48;&#x5F25;&#x8865;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x7167;&#x7740;&#x4ED6;&#x7684;&#x6307;&#x793A;&#x9A6C;&#x4E0A;&#x53BB;&#x627E;&#x4E86;&#x5E26;&#x6211;&#x98DE;&#x7684;&#x5F20;&#x5B66;&#x957F;&#xFF0C;&#x7136;&#x540E;&#x5B66;&#x957F;&#x53C8;&#x544A;&#x8BEB;&#x6211;&#x8001;&#x5B8B;&#x7279;&#x522B;&#x4E25;&#x683C;&#x3002;&#x56DE;&#x5230;&#x5BDD;&#x5BA4;&#x540E;&#x6211;&#x8FDE;&#x665A;&#x996D;&#x90FD;&#x6CA1;&#x987E;&#x4E0A;&#xFF0C;&#x82B1;&#x4E86;&#x4E00;&#x665A;&#x4E0A;&#x65F6;&#x95F4;&#x51E0;&#x4E4E;&#x628A;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x4E2D;&#x7684;&#x6BD5;&#x8BBE;&#x65B9;&#x6848;&#x91CD;&#x65B0;&#x5199;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x5199;&#x5B8C;&#x7684;&#x65F6;&#x5019;&#x611F;&#x89C9;&#x6574;&#x4E2A;&#x4EBA;&#x90FD;&#x865A;&#x8131;&#x4E86;&#xFF0C;&#x8D76;&#x7D27;&#x4E0B;&#x697C;&#x6CE1;&#x4E86;&#x7897;&#x9762;&#x538B;&#x538B;&#x60CA;&#x3002;<br><strong><font size="4">&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x7684;&#x5F00;&#x9898;&#x7B54;&#x8FA9;&#xFF0C;</font></strong>&#x6211;&#x548C;&#x5BA4;&#x53CB;&#x5C0F;&#x90B1;&#x6000;&#x7740;&#x5FD0;&#x5FD1;&#x7684;&#x5FC3;&#x60C5;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5BA4;&#x53CB;&#x5C0F;&#x738B;&#x7684;&#x966A;&#x4F34;&#x4E0B;&#x6765;&#x5230;&#x4E86;&#x5B66;&#x9662;&#x697C;&#x56DB;&#x697C;&#x4F1A;&#x8BAE;&#x5BA4;&#x3002;&#x90A3;&#x65F6;&#x5019;&#x5E94;&#x8BE5;&#x8FD8;&#x6CA1;&#x5230;&#x516B;&#x70B9;&#x5427;&#xFF0C;&#x611F;&#x89C9;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x65E9;&#x8D77;&#x4E86;&#x3002;&#x7136;&#x540E;&#x6211;&#x62FF;&#x7740;&#x6211;&#x7684;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x7ED9;&#x8001;&#x9EC4;&#x7B7E;&#x5B57;&#xFF0C;&#x8001;&#x9EC4;&#x77A5;&#x4E86;&#x6211;&#x4E00;&#x773C;&#xFF0C;&#x8BF4;&#x4F60;&#x90FD;&#x6309;&#x6211;&#x8BF4;&#x7684;&#x6539;&#x8FC7;&#x4E86;&#x5427;&#x3002;&#x6211;&#x5600;&#x5495;&#x4E86;&#x4E00;&#x53E5;&#xFF0C;&#x60A8;&#x90A3;&#x54EA;&#x662F;&#x8981;&#x6C42;&#x6211;&#x6539;&#x5440;&#xFF0C;&#x60A8;&#x662F;&#x8BA9;&#x6211;&#x91CD;&#x5199;&#x5440;&#x3002;&#x8001;&#x9EC4;&#x201C;&#x55EF;&#xFF1F;&#x201D;&#x4E86;&#x4E00;&#x58F0;&#xFF0C;&#x6211;&#x5FD9;&#x8BF4;&#x6539;&#x8FC7;&#x4E86;&#x6539;&#x8FC7;&#x4E86;&#x3002;&#x4ED6;&#x7FFB;&#x4E86;&#x7FFB;&#xFF0C;&#x521A;&#x51C6;&#x5907;&#x7B7E;&#x5B57;&#xFF0C;&#x5FFD;&#x7136;&#x6307;&#x7740;&#x6559;&#x5E08;&#x7B7E;&#x5B57;&#x90A3;&#x4E00;&#x9875;&#x5BF9;&#x6211;&#x8BF4;&#x8FD9;&#x9875;&#x4E0D;&#x5BF9;&#x5440;&#xFF0C;&#x600E;&#x4E48;&#x201C;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#x7684;&#x5177;&#x4F53;&#x8981;&#x6C42;&#x201D;&#x8FD9;&#x4E00;&#x680F;&#x5B57;&#x8FD9;&#x4E48;&#x5C11;&#xFF0C;&#x6587;&#x732E;&#x7EFC;&#x8FF0;&#x7684;&#x8981;&#x6C42;&#x5462;&#xFF1F;&#x6211;&#x5FC3;&#x60F3;&#x5B8C;&#x4E86;&#xFF0C;&#x5FD8;&#x4E86;&#x628A;&#x5BF9;&#x6587;&#x732E;&#x7EFC;&#x8FF0;&#x7684;&#x8981;&#x6C42;&#x8D34;&#x4E0A;&#x6765;&#x4E86;&#x3002;&#x8FD8;&#x597D;&#x6211;&#x673A;&#x667A;&#x5730;&#x5E26;&#x4E86;&#x7535;&#x8111;&#x3002;&#x6211;&#x5FD9;&#x6253;&#x5F00;&#x7535;&#x8111;&#x5F00;&#x59CB;&#x6539;&#xFF0C;&#x8FB9;&#x4E0A;&#x7684;&#x5C0F;&#x9C81;&#x540C;&#x5B66;&#x95EE;&#x6211;&#x4F60;&#x5728;&#x6539;&#x5565;&#x5440;&#xFF0C;&#x6211;&#x8BF4;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#x7684;&#x5177;&#x4F53;&#x8981;&#x6C42;&#x5C11;&#x8D34;&#x4E86;&#x4E00;&#x6BB5;&#xFF0C;&#x5C0F;&#x9C81;&#x540C;&#x5B66;( &#x2299; o &#x2299; )&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x4E0D;&#x662F;&#x5C31;&#x662F;&#x8FDB;&#x5EA6;&#x5B89;&#x6392;&#x5417;&#x3002;&#x6211;&#x987F;&#x4E86;&#x4E00;&#x4E0B;&#x8BF4;&#x4E0D;&#x662F;&#x5440;&#xFF0C;&#x8FDB;&#x5EA6;&#x5B89;&#x6392;&#x5199;&#x5728;&#x6700;&#x540E;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x8981;&#x6C42;&#x8981;&#x5230;&#x6559;&#x52A1;&#x7CFB;&#x7EDF;&#x53BB;&#x4E0B;&#x7684;&#x3002;&#x5C0F;&#x9C81;&#x540C;&#x5B66;&#x554A;&#x4E86;&#x4E00;&#x58F0;&#xFF0C;&#x8BF4;&#x90A3;&#x4E0D;&#x662F;&#x6211;&#x4E5F;&#x641E;&#x9519;&#x4E86;&#x3002;&#x6211;&#x5934;&#x4E5F;&#x4E0D;&#x62AC;&#x5730;&#x5E94;&#x4ED8;&#x5230;&#xFF1A;&#x5C0F;&#x4E8B;&#xFF0C;&#x7B49;&#x6211;&#x5F04;&#x5B8C;&#x7535;&#x8111;&#x501F;&#x4F60;&#x6539;&#x3002;&#x7B49;&#x6211;&#x4EEC;&#x6539;&#x5B8C;&#x5C31;&#x62FF;&#x7740;U&#x76D8;&#x5230;&#x9694;&#x58C1;&#x7684;&#x5B9E;&#x9A8C;&#x5BA4;&#x6253;&#x5370;&#xFF0C;&#x8FD9;&#x65F6;&#x5B9E;&#x9A8C;&#x5BA4;&#x5DF2;&#x7ECF;&#x805A;&#x96C6;&#x4E86;&#x5F88;&#x591A;&#x540C;&#x7EC4;&#x7B54;&#x8FA9;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6211;&#x5F80;&#x5B9E;&#x9A8C;&#x5BA4;&#x7535;&#x8111;&#x4E0A;&#x77A5;&#x4E86;&#x4E00;&#x773C;&#xFF0C;&#x95EE;&#x6B63;&#x5728;&#x6539;&#x7684;&#x4EFB;&#x540C;&#x5B66;&#xFF0C;&#x5509;&#x540C;&#x5B66;&#x4F60;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5440;&#x3002;&#x4EFB;&#x540C;&#x5B66;&#x62B1;&#x6028;&#x9053;&#xFF0C;&#x8001;&#x53F6;&#xFF08;&#x4EFB;&#x540C;&#x5B66;&#x7684;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#xFF09;&#x5ACC;&#x6211;&#x5B57;&#x4F53;&#x4E0D;&#x5BF9;&#xFF0C;&#x6211;&#x4E00;&#x770B;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x521A;&#x521A;&#x6539;&#x7684;&#x90A3;&#x9875;&#x561B;&#xFF0C;&#x5FD9;&#x95EE;&#x5979;&#x8001;&#x5E08;&#x5177;&#x4F53;&#x7684;&#x683C;&#x5F0F;&#x8981;&#x6C42;&#x3002;&#x4EFB;&#x540C;&#x5B66;&#x62FF;&#x7740;&#x6253;&#x5370;&#x597D;&#x7684;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x53BB;&#x627E;&#x8001;&#x53F6;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x5F00;&#x59CB;&#x6539;&#x6211;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x8FC7;&#x4E86;&#x51E0;&#x79D2;&#x949F;&#x4EFB;&#x540C;&#x5B66;&#x53C8;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x62B1;&#x6028;&#x9053;&#x5C3C;&#x739B;&#x8001;&#x53F6;&#x5ACC;&#x6211;&#x5B57;&#x592A;&#x5C0F;&#x4E86;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#x597D;&#x561B;&#x8FD8;&#x597D;&#x6211;&#x8FD8;&#x6CA1;&#x6253;&#x5370;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x6539;&#xFF0C;&#x5728;&#x4F17;&#x4EBA;&#x7684;&#x56F4;&#x89C2;&#x7763;&#x4FC3;&#x4E0B;&#x6539;&#x597D;&#x6253;&#x5370;&#x5B8C;&#xFF0C;&#x7136;&#x540E;&#x987A;&#x5E26;&#x5E2E;&#x5C0F;&#x9C81;&#x540C;&#x5B66;&#x88C5;&#x8BA2;&#x597D;&#xFF0C;&#x56DE;&#x5230;&#x4F1A;&#x8BAE;&#x5BA4;&#xFF0C;&#x5C3C;&#x739B;&#x8FD9;&#x624D;&#x7B54;&#x8FA9;&#x5B8C;&#x4E00;&#x4E2A;&#xFF0C;&#x4E5F;&#x592A;&#x6162;&#x4E86;&#xFF0C;&#x8FC7;&#x4E86;&#x5341;&#x51E0;&#x4E8C;&#x5341;&#x591A;&#x5206;&#x949F;&#x4E86;&#x5440;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x6587;&#x732E;&#x7EFC;&#x8FF0;&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x4EA4;&#x7ED9;&#x5404;&#x81EA;&#x7684;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#xFF0C;&#x7136;&#x540E;&#x627E;&#x4E86;&#x4E2A;&#x7A7A;&#x6905;&#x5B50;&#x505A;&#x4E86;&#x4E0B;&#x6765;&#x3002;<br><strong><font size="4">&#x7B2C;&#x4E8C;&#x4E2A;&#x540C;&#x5B66;&#x7B54;&#x8FA9;&#x5B8C;&#x540E;&#x63A5;&#x4E0B;&#x6765;&#x90A3;&#x4E2A;&#x662F;&#x6211;&#x5BA4;&#x53CB;&#x5C0F;&#x90B1;&#xFF0C;</font></strong>&#x4ED6;&#x6709;&#x4E2A;tplink&#x9762;&#x8BD5;&#x6240;&#x4EE5;&#x627E;&#x8001;&#x5E08;&#x63D0;&#x524D;&#x4E86;&#x3002;&#x5C0F;&#x90B1;&#x90A3;&#x53AE;&#x5728;&#x8BF4;&#x5B8C;&#x5B83;&#x7684;PPT&#x4E4B;&#x540E;&#xFF0C;&#x7AD9;&#x5728;&#x53F0;&#x4E0A;&#x4E00;&#x8138;&#x8870;&#x6837;&#xFF0C;&#x6211;&#x521A;&#x60F3;&#x8BF4;&#x4F60;&#x4E2B;&#x8FD9;&#x8868;&#x60C5;&#x51E0;&#x4E2A;&#x610F;&#x601D;&#x7ED3;&#x679C;&#x63A5;&#x4E0B;&#x6765;&#x5341;&#x51E0;&#x5206;&#x949F;&#x7684;&#x4E8B;&#x5413;&#x54ED;&#x6211;&#x4E86;&#x3002;&#x5148;&#x662F;&#x8BFE;&#x9898;&#x7EC4;&#x8001;&#x5927;&#x8001;&#x5B8B;&#x53D1;&#x8A00;&#xFF0C;&#x8001;&#x5B8B;&#x8BF4;&#x4F60;&#x8FD9;&#x5F00;&#x9898;&#x5F00;&#x7684;&#x4E0D;&#x884C;&#x554A;&#x7136;&#x540E;&#x5DF4;&#x62C9;&#x5DF4;&#x62C9;&#x8BF4;&#x4E86;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x4EC0;&#x4E48;&#x65B9;&#x6848;&#x4E0D;&#x591F;&#x6E05;&#x695A;&#x3001;&#x7535;&#x8DEF;&#x56FE;&#x6CA1;&#x753B;&#x3001;&#x7528;&#x4EC0;&#x4E48;&#x51FD;&#x6570;&#x6CA1;&#x8BF4;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#xFF0C;&#x8BF4;&#x5B8C;&#x540E;&#x8001;&#x5B8B;&#x8F6C;&#x5934;&#x95EE;&#x8001;&#x9EC4;&#x4ED6;&#x4EEC;&#x6587;&#x732E;&#x7EFC;&#x8FF0;&#x6709;&#x95EE;&#x9898;&#x5417;&#xFF0C;&#x8001;&#x9EC4;&#x8BF4;&#x4F60;&#x8FD9;&#x7EFC;&#x8FF0;&#x4E0D;&#x5BF9;&#x5440;&#x5DF4;&#x62C9;&#x5DF4;&#x62C9;&#x53C8;&#x662F;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x5177;&#x4F53;&#x6587;&#x732E;20&#x7BC7;&#x5F15;&#x7528;&#x4E0D;&#x591F;&#x5440;&#x6587;&#x732E;&#x5F15;&#x7528;&#x6CA1;&#x6709;&#x6807;&#x6CE8;&#x5440;&#x6587;&#x732E;&#x5185;&#x5BB9;&#x548C;&#x4F60;&#x8BFE;&#x9898;&#x76F8;&#x5173;&#x6027;&#x4E0D;&#x5927;&#x5440;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x5BF9;&#x5440;&#xFF0C;&#x8BF4;&#x5B8C;&#x540E;&#x6211;&#x6DF1;&#x547C;&#x4E00;&#x53E3;&#x6C14;&#x5FC3;&#x60F3;&#x8FD9;&#x4E0B;&#x8BE5;&#x4E0B;&#x6765;&#x4E86;&#x5427;&#x2026;&#x2026;&#x7ED3;&#x679C;&#x8FB9;&#x4E0A;&#x7684;&#x8001;&#x4FDE;&#x8BF4;&#x6211;&#x8865;&#x5145;&#x51E0;&#x70B9;&#xFF0C;&#x63A5;&#x7740;&#x8001;&#x4FDE;&#x53C8;&#x5BF9;&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x5F00;&#x59CB;&#x6307;&#x5BFC;&#xFF0C;&#x8BF4;&#x4F60;&#x8FD9;&#x683C;&#x5F0F;&#x4E0D;&#x5BF9;&#x5440;&#x8FD9;&#x91CC;&#x591A;&#x7A7A;&#x4E86;&#x4E00;&#x884C;&#x8FD9;&#x5B57;&#x4F53;&#x4E5F;&#x4E0D;&#x5BF9;&#x5440;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#x53C8;&#x8BF4;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x8FD9;&#x4E0B;&#x8BE5;&#x5B8C;&#x4E86;&#x5427;&#xFF0C;&#x7ED3;&#x679C;&#x8001;&#x4FDE;&#x6700;&#x540E;&#x8865;&#x4E86;&#x4E00;&#x53E5;&#x8BF4;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x6211;&#x53BB;&#x8FD9;&#x65F6;&#x5019;&#x8001;&#x53F6;&#x5F00;&#x59CB;&#x53D1;&#x8A00;&#x4E86;&#x3002;&#x8001;&#x53F6;&#x53C8;&#x5F00;&#x59CB;&#x5410;&#x69FD;&#xFF0C;&#x4F60;&#x8FD9;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x91CD;&#x70B9;&#x4E0D;&#x5BF9;&#x5440;XXX&#x660E;&#x660E;&#x6CA1;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x4F60;&#x5199;&#x4E86;&#x4E24;&#x5343;&#x591A;&#x5B57;XXX&#x660E;&#x660E;&#x662F;&#x91CD;&#x70B9;&#x4F60;&#x7528;&#x51E0;&#x767E;&#x5B57;&#x5C31;&#x5E26;&#x8FC7;&#x6765;&#x3002;&#x5929;&#x54EA;&#x8FD9;&#x8FD8;&#x8BA9;&#x4EBA;&#x6D3B;&#x4E86;&#xFF0C;&#x771F;&#x662F;&#x5FC3;&#x7D2F;&#x3002;&#x8001;&#x53F6;&#x8BF4;&#x4E86;&#x534A;&#x5929;&#x7EC8;&#x4E8E;&#x8BF4;&#x5B8C;&#x4E86;&#xFF0C;&#x8001;&#x5B8B;&#x5927;&#x624B;&#x4E00;&#x6325;&#x8BF4;&#x4E0B;&#x53BB;&#x5427;&#xFF0C;&#x6211;&#x5BB6;&#x5C0F;&#x90B1;&#x624D;&#x5E26;&#x7740;o(&#x256F;&#x25A1;&#x2570;)o&#x6837;&#x4ECE;&#x53F0;&#x4E0A;&#x7070;&#x6E9C;&#x6E9C;&#x6EDA;&#x4E0B;&#x6765;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#x8FD9;&#x5C3C;&#x739B;&#x5F00;&#x6279;&#x6597;&#x5927;&#x4F1A;&#x5462;&#x3002;&#x5C0F;&#x90B1;&#x7B54;&#x8FA9;&#x7ED3;&#x675F;&#x5C31;&#x548C;&#x5C0F;&#x738B;&#x4E00;&#x8D77;&#x8D70;&#x4E86;&#xFF0C;&#x5C0F;&#x738B;&#x770B;&#x4E86;&#x51E0;&#x7EC4;&#x4E5F;&#x770B;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#x8BF4;&#x4F60;&#x4EEC;&#x7EC4;&#x4E5F;&#x592A;&#x4E25;&#x4E86;&#xFF0C;&#x8FD9;&#x65F6;&#x6D3B;&#x751F;&#x751F;&#x7ED9;&#x5413;&#x8D70;&#x4E86;&#x5440;&#x3002;&#x6211;&#x770B;&#x4E86;&#x770B;&#x65F6;&#x95F4;&#x53D1;&#x73B0;&#x5C0F;&#x90B1;&#x5728;&#x53F0;&#x4E0A;&#x5446;&#x4E86;&#x4E8C;&#x5341;&#x591A;&#x5206;&#x949F;&#xFF0C;&#x53EF;&#x662F;&#x4ED6;&#x8BB2;&#x81EA;&#x5DF1;PPT&#x7684;&#x65F6;&#x95F4;&#x624D;&#x4E94;&#x516D;&#x5206;&#x949F;&#x5440;&#xFF0C;( &#x2299; o &#x2299; )&#x554A;&#xFF01;<br><strong><font size="4">&#x5C0F;&#x90B1;&#x540E;&#x9762;&#x8FD8;&#x6709;&#x4E09;&#x4E2A;&#x4EBA;&#x624D;&#x5230;&#x6211;&#x3002;&#x6211;&#x5C31;&#x548C;&#x8FB9;&#x4E0A;&#x7684;&#x5C0F;&#x80E1;&#x95F2;&#x804A;&#x8D77;&#x6765;&#x3002;</font></strong>&#x6211;&#x8BF4;&#x5C3C;&#x739B;&#x8FD9;&#x4E5F;&#x592A;&#x4E25;&#x4E86;&#x5427;&#xFF0C;&#x6211;&#x4EE5;&#x524D;&#x53EA;&#x662F;&#x542C;&#x8BF4;&#x8001;&#x5B8B;&#x4E25;&#x4ECA;&#x65E5;&#x4EB2;&#x773C;&#x6240;&#x89C1;&#x5413;&#x54ED;&#x4E86;&#xFF0C;&#x5C0F;&#x80E1;&#x8BF4;&#x5BF9;&#x5440;&#x8001;&#x5B8B;&#x7EC4;&#x6700;&#x4E25;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x8001;&#x9648;&#x7EC4;&#xFF0C;&#x8001;&#x5468;&#x7EC4;&#x6700;&#x6C34;&#xFF0C;&#x6628;&#x5929;&#x4ED6;&#x4EEC;&#x7B54;&#x8FA9;&#x6C34;&#x6C34;&#x5C31;&#x8FC7;&#x4E86;&#x3002;&#x6211;&#x60F3;&#x5C3C;&#x739B;&#x6211;&#x672C;&#x6765;&#x9009;&#x8001;&#x5468;&#x7684;&#x6BD5;&#x8BBE;&#x9898;&#x76EE;&#x7684;&#x7ED3;&#x679C;&#x8FD9;&#x53AE;&#x628A;&#x6211;&#x8E22;&#x4E86;&#x6211;&#x88AB;&#x903C;&#x65E0;&#x5948;&#x624D;&#x9009;&#x8001;&#x9EC4;&#x7684;&#x5440;&#xFF01;&#x8001;&#x5468;&#x6211;&#x6068;&#x4F60;&#x4E00;&#x8F88;&#x5B50;&#x3002;&#x3002;&#x3002;&#x53F0;&#x4E0A;&#x6B63;&#x5728;&#x8BB2;&#x7684;&#x662F;&#x5C0F;&#x80E1;&#x7684;&#x540C;&#x4F34;&#xFF0C;PPT&#x6CA1;&#x5565;&#x5E72;&#x8D27;&#xFF0C;&#x5C31;&#x8D34;&#x4E86;&#x4E00;&#x5806;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x56FE;&#x7247;&#x3002;&#x4ED6;&#x8BB2;&#x5B8C;&#x8001;&#x5E08;&#x5F00;&#x59CB;&#x201D;&#x6307;&#x70B9;&#x4ED6;&#x4E86;&#x201D;&#xFF0C;&#x8001;&#x5E08;&#x8BF4;&#x4ED6;&#x8BF4;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x4ED6;&#x5728;&#x90A3;&#x91CC;&#x89E3;&#x91CA;&#x3002;&#x5C0F;&#x80E1;&#x8BF4;&#x6211;&#x65E9;&#x548C;&#x4ED6;&#x8BF4;&#x8FC7;&#x8FD9;&#x6837;&#x8BF4;&#x4E0D;&#x884C;&#xFF0C;&#x8FD8;&#x6709;&#x8001;&#x5E08;&#x8BF4;&#x4E86;&#x4EC0;&#x4E48;&#x4F60;&#x5C31;&#x542C;&#x7740;&#x5C31;&#x597D;&#x4E86;&#x89E3;&#x91CA;&#x5565;&#x5440;&#xFF0C;&#x4F60;&#x6709;&#x8001;&#x5E08;&#x61C2;&#xFF1F;&#x6211;&#x5E94;&#x9053;&#x5BF9;&#x5440;&#x8FD9;&#x6837;&#x8BF4;&#x4E0B;&#x53BB;&#x6CA1;&#x5B8C;&#x6CA1;&#x4E86;&#x4E86;&#x8001;&#x5E08;&#x9A82;&#x7684;&#x66F4;&#x72E0;&#x3002;&#x679C;&#x4E0D;&#x5176;&#x7136;&#xFF0C;&#x8FD9;&#x54E5;&#x4EEC;&#x8FC7;&#x4E86;&#x534A;&#x5C0F;&#x65F6;&#x624D;&#x90C1;&#x90C1;&#x4E0D;&#x4E50;&#x5730;&#x4E0B;&#x6765;&#x3002;&#x5C0F;&#x80E1;&#x6570;&#x843D;&#x4ED6;&#xFF0C;&#x6211;&#x5C31;&#x53EB;&#x4F60;&#x522B;&#x89E3;&#x91CA;&#x5427;&#xFF0C;&#x7406;&#x7531;&#x8FD9;&#x4E48;&#x591A;&#x3002;&#x90A3;&#x54E5;&#x4EEC;&#x82E6;&#x7B11;&#x4E86;&#x4E00;&#x4E0B;&#x3002;<br><strong><font size="4">&#x7EC8;&#x4E8E;&#x8F6E;&#x5230;&#x6211;&#x4E86;&#xFF0C;</font></strong>&#x6211;&#x5E26;&#x7740;&#x4E00;&#x526F;&#x6B7B;&#x732A;&#x4E0D;&#x6015;&#x5F00;&#x6C34;&#x70EB;&#x7684;&#x8868;&#x60C5;&#x5927;&#x6447;&#x5927;&#x6446;&#x5730;&#x4E0A;&#x53F0;&#x4E86;&#xFF0C;&#x6E05;&#x4E86;&#x6E05;&#x55D3;&#x5B50;&#x5F00;&#x59CB;&#x8BB2;&#x3002;&#x5F00;&#x59CB;&#x6709;&#x5F88;&#x591A;&#x80CC;&#x666F;&#x548C;&#x7406;&#x8BBA;&#x57FA;&#x7840;&#xFF0C;&#x6211;&#x8BF4;&#x8FD9;&#x4E9B;&#x6CA1;&#x5565;&#x7528;&#x90A3;&#x6211;&#x5C31;&#x8DF3;&#x8FC7;&#x4E86;&#x54C8;&#xFF0C;&#x4E0B;&#x9762;&#x8001;&#x53F6;&#x8BF4;&#x597D;&#x3002;&#x6211;&#x5C31;&#x76F4;&#x63A5;&#x5F00;&#x59CB;&#x8BB2;&#x7814;&#x7A76;&#x5185;&#x5BB9;&#x548C;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x7684;&#x65B9;&#x6848;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x6E05;&#x695A;&#x7684;&#xFF0C;&#x6211;&#x5206;&#x6210;&#x597D;&#x51E0;&#x6B65;&#x7136;&#x540E;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x8BE6;&#x7EC6;&#x8BF4;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x4E4B;&#x540E;&#x6211;&#x628A;&#x4E2D;&#x671F;&#x68C0;&#x67E5;&#x65F6;&#x8981;&#x8FBE;&#x5230;&#x7684;&#x6210;&#x679C;&#x8BF4;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x8BF4;&#x5B8C;&#x5F80;&#x8001;&#x5B8B;&#x90A3;&#x513F;&#x770B;&#x4E86;&#x4E00;&#x773C;&#xFF0C;&#x8001;&#x5B8B;&#x7ADF;&#x7136;&#x5728;&#x5BF9;&#x6211;&#x7B11;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#x4E0D;&#x5999;&#x5440;&#xFF0C;&#x8001;&#x5B8B;&#x7B11;&#x772F;&#x772F;&#x5730;&#x8BF4;&#x4F60;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x660E;&#x786E;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x505A;&#x51FA;&#x6765;&#x80FD;&#x9A71;&#x52A8;&#x8D85;&#x58F0;&#x7535;&#x673A;&#x4F60;&#x5C31;&#x6BD5;&#x4E1A;&#x3002;&#x6211;&#x8BF4;&#x597D;&#x5FC3;&#x7406;&#x6697;&#x559C;&#x9053;&#x96BE;&#x9053;&#x8FD9;&#x6837;&#x5C31;&#x8FC7;&#x4E86;&#xFF1F;&#x8FD9;&#x65F6;&#x8001;&#x53F6;&#x53D1;&#x8BDD;&#x4E86;&#xFF0C;&#x4F60;&#x8FD9;PPT&#x600E;&#x4E48;&#x505A;&#x7684;&#xFF0C;&#x6DF1;&#x84DD;&#x80CC;&#x666F;&#x9ED1;&#x8272;&#x5B57;&#x4F53;&#xFF0C;&#x8FD8;&#x8BA9;&#x4E0D;&#x8BA9;&#x770B;&#x4E86;&#xFF01;&#x6211;&#x8D76;&#x7D27;&#x70B9;&#x5934;&#x55EF;&#x55EF;&#xFF0C;&#x53F0;&#x4E0B;&#x6709;&#x540C;&#x5B66;&#x8D77;&#x54C4;&#x8BF4;&#x5B57;&#x90FD;&#x5230;PPT&#x5916;&#x9762;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x5600;&#x5495;&#x9053;&#x5C31;&#x4F60;&#x8BDD;&#x591A;&#x3002;&#x8001;&#x53F6;&#x53C8;&#x8BF4;&#x4F60;&#x8FD9;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x6709;&#x522B;&#x5B57;&#x5440;&#xFF0C;&#x4F60;&#x8FD9;PPT&#x4E5F;&#x6709;&#xFF0C;&#x56DE;&#x53BB;&#x68C0;&#x67E5;&#x4E0B;&#x3002;&#x6211;&#x53EA;&#x987E;&#x7740;&#x70B9;&#x5934;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x8001;&#x9EC4;&#x53D1;&#x8BDD;&#x4E86;&#xFF0C;&#x8001;&#x9EC4;&#x662F;&#x6211;&#x7684;&#x6307;&#x5BFC;&#x8001;&#x5E08;&#xFF0C;&#x8BF4;&#x5C31;&#x6015;&#x4F60;&#x6CA1;&#x628A;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x5403;&#x900F;&#xFF0C;&#x6CA1;&#x6709;&#x771F;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x53EA;&#x662F;&#x628A;&#x5B66;&#x957F;&#x90A3;&#x513F;&#x7684;&#x8D44;&#x6599;&#x62FF;&#x8FC7;&#x6765;&#x5957;&#x4E0A;&#x53BB;&#x7528;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x610F;&#x4E49;&#x5417;&#x3002;&#x6211;&#x8BED;&#x585E;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x65F6;&#x5019;&#x6C89;&#x9ED8;&#x662F;&#x6700;&#x597D;&#x7684;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#x3002;&#x8001;&#x5B8B;&#x8FD9;&#x65F6;&#x53D1;&#x8BDD;&#x4E86;&#xFF0C;&#x8BF4;&#x4F60;&#x8FD9;PPT&#x4E0A;&#x8C22;&#x8C22;&#x6B23;&#x8D4F;&#x8FD9;&#x8BCD;&#x7528;&#x7684;&#x4E0D;&#x884C;&#xFF0C;&#x6211;&#x4E00;&#x54AF;&#x5654;&#xFF0C;&#x8FD9;&#x5C3C;&#x739B;&#x4E5F;&#x80FD;&#x6311;&#x523A;&#x3002;&#x8001;&#x5B8B;&#x8BF4;&#x6211;&#x4EEC;&#x8FD9;&#x662F;&#x5B66;&#x672F;&#x7B54;&#x8FA9;&#xFF0C;&#x5B66;&#x672F;&#x600E;&#x4E48;&#x80FD;&#x7528;&#x6B23;&#x8D4F;&#x5462;&#x2026;&#x2026;&#x5DF4;&#x62C9;&#x5DF4;&#x62C9;&#x8BF4;&#x4E86;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x6211;&#x5FD9;&#x70B9;&#x5934;&#x55EF;&#x55EF;&#x3002;&#x4E4B;&#x540E;&#x8001;&#x4FDE;&#x53C8;&#x6307;&#x51FA;&#x4E86;&#x6211;&#x7FFB;&#x8BD1;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x683C;&#x5F0F;&#x9519;&#x8BEF;&#xFF0C;&#x6BD4;&#x5982;&#x5C01;&#x9762;&#x4E0A;&#x5E74;&#x7EA7;&#x4E00;&#x680F;&#x6211;&#x5199;&#x6210;&#x201C;&#x5927;&#x56DB;&#x201D;&#x3002;&#x521A;&#x521A;&#x8D77;&#x54C4;&#x7684;&#x540C;&#x5B66;&#x542C;&#x5230;&#x540E;&#x53C8;&#x54C4;&#x7B11;&#x8D77;&#x6765;&#x3002;&#x6211;&#x60F3;&#x4EC0;&#x4E48;&#x4EC7;&#x4EC0;&#x4E48;&#x6028;&#x6211;&#x5F97;&#x7F6A;&#x8FC7;&#x4F60;&#x5417;&#x6211;&#x548C;&#x4F60;&#x53C8;&#x4E0D;&#x719F;&#x7136;&#x540E;&#x77AA;&#x4E86;&#x4ED6;&#x4E00;&#x773C;&#x3002;&#x5728;&#x6211;&#x55EF;&#x55EF;&#x5E94;&#x4ED8;&#x5B8C;&#x8001;&#x4FDE;&#x540E;&#x6211;&#x5C31;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x672C;&#x7740;&#x201C;&#x4E0D;&#x548C;&#x8001;&#x5E08;&#x4E89;&#x8FA9;&#x539F;&#x5219;&#x201D;&#x6211;&#x5927;&#x6982;&#x82B1;&#x4E86;&#x5341;&#x591A;&#x5206;&#x949F;&#x5C31;&#x4E0B;&#x6765;&#x4E86;&#xFF0C;&#x5728;&#x4F17;&#x591A;&#x7B54;&#x8FA9;&#x5B8C;&#x7684;&#x540C;&#x5B66;&#x4E2D;&#x4E5F;&#x7B97;&#x9E64;&#x7ACB;&#x9E21;&#x7FA4;&#x3002;&#x6211;&#x60F3;&#x7740;&#x65B9;&#x6848;&#x6CA1;&#x95EE;&#x9898;&#x5F00;&#x9898;&#x7A33;&#x4E86;&#x5427;&#x3002;(<em>^__^</em>) &#x563B;&#x563B;&#x2026;&#x2026;<br><strong><font size="4">&#x6211;&#x5927;&#x6982;&#x662F;&#x7B2C;&#x4E03;&#x4E2A;&#xFF0C;&#x540E;&#x9762;&#x8FD8;&#x6709;&#x5341;&#x51E0;&#x4E2A;&#x540C;&#x5B66;&#x3002;</font></strong>&#x6211;&#x7B54;&#x8FA9;&#x5B8C;&#x5DF2;&#x7ECF;&#x5FEB;&#x5341;&#x70B9;&#x4E86;&#xFF0C;&#x8FD9;&#x901F;&#x5EA6;&#x4E5F;&#x662F;&#x9189;&#x4E86;&#x3002;&#x5269;&#x4E0B;&#x7684;&#x4E8B;&#x4E0E;&#x6211;&#x65E0;&#x5173;&#x4E86;&#xFF0C;&#x6211;&#x53C8;&#x4E0D;&#x80FD;&#x65E9;&#x9000;&#xFF0C;&#x4E8E;&#x662F;&#x5F00;&#x59CB;&#x6446;&#x5F04;&#x6211;&#x7684;&#x7535;&#x8111;&#x3002;&#x673A;&#x667A;&#x5982;&#x6211;&#xFF0C;&#x8FD8;&#x5E26;&#x4E86;&#x7535;&#x8111;&#xFF0C;&#x6211;&#x5411;&#x5C0F;&#x80E1;&#x70AB;&#x8000;&#x3002;&#x5C0F;&#x80E1;&#x70B9;&#x5934;&#x79F0;&#x662F;&#x7136;&#x540E;&#x628A;&#x624B;&#x673A;&#x6570;&#x636E;&#x7EBF;&#x63D2;&#x5230;&#x6211;&#x7535;&#x8111;&#x4E0A;&#x5F00;&#x59CB;&#x7ED9;&#x81EA;&#x5DF1;&#x7535;&#x91CF;&#x4E0D;&#x591A;&#x7684;&#x624B;&#x673A;&#x5145;&#x7535;&#x3002;&#x8FD9;&#x65F6;&#x6211;&#x524D;&#x4E00;&#x5929;&#x665A;&#x4E0A;&#x52A0;&#x7684;XX&#x8857;&#x7684;&#x5B66;&#x59D0;&#x56DE;&#x590D;&#x6211;qq&#x4E86;&#xFF0C;&#x5B66;&#x59D0;&#x5E2E;&#x6211;&#x5185;&#x63A8;&#xFF0C;&#x8BA9;&#x6211;&#x628A;&#x7B80;&#x5386;&#x53D1;&#x5979;&#x770B;&#x770B;&#x3002;&#x6211;&#x53D1;&#x8FC7;&#x53BB;&#x540E;&#x8FC7;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5B66;&#x59D0;&#x56DE;&#x6211;&#x4E86;&#xFF0C;&#x5979;&#x6BEB;&#x4E0D;&#x7559;&#x60C5;&#x5730;&#x6307;&#x51FA;&#x4E86;&#x6211;&#x7B80;&#x5386;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x4FE1;&#x606F;&#x4E71;&#x5440;&#xFF0C;&#x6280;&#x80FD;&#x5199;&#x592A;&#x957F;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x5B9E;&#x4E60;&#x7ECF;&#x5386;&#x592A;&#x7B80;&#x5355;&#x7B49;&#x7B49;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5B66;&#x6821;&#x548C;&#x4E13;&#x4E1A;&#x5199;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5B66;&#x59D0;&#x539F;&#x8BDD;&#x662F;&#x201C;&#x522B;&#x4EBA;&#x8FD8;&#x4EE5;&#x4E3A;&#x662F;&#x54EA;&#x4E2A;&#x5341;&#x516B;&#x672C;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x7684;&#x201D;&#x3002;&#x8BDD;&#x867D;&#x7136;&#x635F;&#x4E86;&#x70B9;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x5F88;&#x6709;&#x9053;&#x7406;&#x3002;&#x6211;&#x4E00;&#x5934;&#x6C57;&#xFF0C;&#x7B80;&#x5386;&#x5199;&#x7684;&#x7565;&#x5DEE;&#xFF0C;&#x6211;&#x8FD8;&#x6295;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x516C;&#x53F8;&#xFF0C;&#x4E22;&#x6B7B;&#x4EBA;&#x4E86;&#x3002;&#x7167;&#x5B66;&#x59D0;&#x8BF4;&#x7684;&#x6539;&#x4E86;&#x56DB;&#x6B21;&#x7EC8;&#x4E8E;&#x6EE1;&#x8DB3;&#x5979;&#x7684;&#x8981;&#x6C42;&#x4E86;&#x3002;&#x6211;&#x7684;&#x7B80;&#x5386;&#x770B;&#x4E0A;&#x53BB;&#x4E5F;&#x50CF;&#x6837;&#x591A;&#x4E86;&#x3002;&#x6BD5;&#x7ADF;&#x4EB2;&#x5B66;&#x59D0;&#xFF0C;&#x867D;&#x7136;&#x8BDD;&#x8BF4;&#x7684;&#x6BD4;&#x8F83;&#x76F4;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x7ED9;&#x6211;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x5979;&#x5E2E;&#x6211;&#x6295;&#x4E86;&#x4E4B;&#x540E;&#x6211;&#x5728;&#x5B83;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x586B;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5F00;&#x59CB;&#x7B49;&#x901A;&#x77E5;&#x3002;<br><strong><font size="4">&#x6211;&#x540E;&#x9762;&#x7B54;&#x8FA9;&#x7684;&#x5341;&#x51E0;&#x4E2A;&#x540C;&#x5B66;&#x4E5F;&#x662F;&#x72B6;&#x51B5;&#x767E;&#x51FA;&#x3002;</font></strong>&#x6709;&#x4E2A;&#x540C;&#x5B66;&#x4E09;&#x5927;&#x4EF6;&#xFF08;&#x5F00;&#x9898;&#x62A5;&#x544A;&#x3001;&#x8BBA;&#x6587;&#x7FFB;&#x8BD1;&#x3001;&#x6587;&#x732E;&#x7EFC;&#x8FF0;&#xFF09;&#x6CA1;&#x4EA4;&#xFF0C;&#x8001;&#x5E08;&#x76F4;&#x63A5;&#x8BA9;&#x4ED6;&#x56DE;&#x53BB;&#x4E86;&#xFF0C;&#x8BF4;&#x4F60;&#x8FD9;&#x8FD8;&#x7B54;&#x8FA9;&#x4EC0;&#x4E48;&#x5440;&#x522B;&#x7B54;&#x8FA9;&#x4E86;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#x8FD9;&#x592A;&#x72E0;&#x4E86;&#x5427;&#x3002;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x540C;&#x5B66;&#x7B54;&#x8FA9;&#x7684;&#x6BD4;&#x8F83;&#x5DEE;&#x8001;&#x5E08;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E0B;&#x5468;&#x4E00;&#x518D;&#x7B54;&#x8FA9;&#xFF08;&#x5305;&#x62EC;&#x90A3;&#x4E2A;&#x8D77;&#x54C4;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x5F88;&#x8BB0;&#x4EC7;&#x7684;&#xFF09;&#x3002;&#x4E00;&#x76F4;&#x7B54;&#x8FA9;&#x5230;&#x5341;&#x4E8C;&#x70B9;&#x534A;&#xFF0C;&#x8001;&#x5B8B;&#x603B;&#x7ED3;&#x8BF4;&#x4F60;&#x4EEC;&#x548C;&#x4E0A;&#x4E00;&#x5C4A;&#x6BD4;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x5DEE;&#x5440;&#x5DF4;&#x62C9;&#x5DF4;&#x62C9;&#x8BF4;&#x4E86;&#x4E00;&#x5806;&#x3002;&#x7136;&#x540E;&#x8BA9;&#x6211;&#x4EEC;&#x62FF;&#x7740;&#x5404;&#x81EA;&#x7684;&#x4E09;&#x5927;&#x4EF6;&#x56DE;&#x53BB;&#x6539;&#x3002;&#x62FF;&#x56DE;&#x6765;&#x4E00;&#x7FFB;&#xFF0C;&#x4E0A;&#x9762;&#x5404;&#x79CD;&#x6279;&#x6CE8;&#xFF0C;&#x8001;&#x4FDE;&#x8001;&#x53F6;&#x8001;&#x9EC4;&#x4E09;&#x4E2A;&#x771F;&#x662F;&#x52AA;&#x529B;&#x7684;&#x4E0D;&#x50CF;&#x8BDD;&#x3002;<br><strong><font size="4">&#x56DE;&#x5BDD;&#x5BA4;&#x540E;&#x53E6;&#x4E00;&#x4E2A;&#x5BA4;&#x53CB;&#x5C0F;&#x848B;&#x521A;&#x8981;&#x51FA;&#x53D1;&#xFF0C;&#x4ED6;&#x662F;&#x8001;&#x9648;&#x7EC4;&#x7684;&#xFF0C;&#x7B54;&#x8FA9;&#x4E0B;&#x5348;&#x4E24;&#x70B9;&#x5F00;&#x59CB;&#x3002;</font></strong>&#x6211;&#x5C31;&#x628A;&#x6211;&#x4EEC;&#x7EC4;&#x7684;&#x60C5;&#x51B5;&#x548C;&#x4ED6;&#x8BF4;&#x4E86;&#x8BF4;&#x3002;&#x4ED6;&#x8868;&#x793A;&#x4E9A;&#x5386;&#x5C71;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4E09;&#x5927;&#x4EF6;&#x8FD8;&#x6CA1;&#x5199;&#x597D;&#x3002;&#x6211;&#x8BA9;&#x4ED6;&#x653E;&#x5BBD;&#x5FC3;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x7EC4;&#x90FD;&#x548C;&#x8001;&#x5B8B;&#x4E00;&#x6837;&#x4E25;&#x7684;&#x3002;&#x4E00;&#x5C0F;&#x65F6;&#x540E;&#x5C0F;&#x848B;&#x53D1;&#x5FAE;&#x4FE1;&#x7ED9;&#x6211;&#x8BF4;&#x5F88;&#x968F;&#x610F;&#x7684;&#x8FC7;&#x4E86;&#xFF0C;&#x6211;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x5BA4;&#x53CB;&#x5C0F;&#x90B1;&#x5C31;&#x60F3;&#x6211;&#x4EEC;&#x7684;&#x547D;&#x548B;&#x5C31;&#x8FD9;&#x4E48;&#x82E6;&#x5462;&#xFF0C;&#x4EBA;&#x6BD4;&#x4EBA;&#x6C14;&#x6B7B;&#x4EBA;&#xFF0C;&#x8001;&#x9648;&#x4F60;&#x770B;&#x8D77;&#x6765;&#x4EBA;&#x6A21;&#x4EBA;&#x6837;&#x7684;&#x7ADF;&#x7136;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x6559;&#x6388;&#xFF01;<br><strong><font size="4">&#x665A;&#x4E0A;XX&#x8857;&#x7684;&#x4EBA;&#x4E8B;&#x52A0;&#x4E86;&#x6211;&#x5FAE;&#x4FE1;&#xFF0C;&#x548C;&#x6211;&#x7EA6;&#x9762;&#x8BD5;&#x65F6;&#x95F4;&#x3002;</font></strong>&#x5728;&#x548C;&#x5979;&#x6C9F;&#x901A;&#x4E2D;&#x6211;&#x624D;&#x53D1;&#x73B0;&#x5979;&#x4EEC;&#x62DB;&#x7684;&#x662F;&#x5B9E;&#x4E60;&#x751F;&#x5C97;&#xFF0C;&#x4E8E;&#x662F;&#x653E;&#x5F03;&#x4E86;&#x8FD9;&#x6B21;&#x9762;&#x8BD5;&#x3002;&#x5BF9;&#x4E0D;&#x8D77;&#x5440;&#x5B66;&#x59D0;&#x3002;&#x3002;&#x3002;/(&#x3112;o&#x3112;)/~~<br>&#x7528;&#x8FD9;&#x7BC7;&#x6D41;&#x6C34;&#x8D26;&#x5F0F;&#x7684;&#x6587;&#x7AE0;&#x8BB0;&#x5F55;&#x6211;&#x6BD5;&#x8BBE;&#x5F00;&#x9898;&#x7684;&#x4E00;&#x5929;&#x3002;&#x6CA1;&#x6709;&#x5BF9;&#x8001;&#x5E08;&#x4E0D;&#x656C;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x8001;&#x5E08;&#x4E25;&#x683C;&#x662F;&#x5BF9;&#x5B66;&#x6821;&#x8D1F;&#x8D23;&#xFF0C;&#x4E5F;&#x662F;&#x5BF9;&#x6211;&#x4EEC;&#x8D1F;&#x8D23;&#x3002;&#x6BD5;&#x8BBE;&#x7684;&#x8FC7;&#x7A0B;&#x80AF;&#x5B9A;&#x4F1A;&#x6210;&#x4E3A;&#x6211;&#x5B9D;&#x8D35;&#x7684;&#x4EBA;&#x751F;&#x8D22;&#x5BCC;&#x3002;<strong><font size="4">&#x5927;&#x56DB;&#x4E0D;&#x6613;&#xFF0C;&#x4E14;&#x884C;&#x4E14;&#x73CD;&#x60DC;&#x3002;</font></strong>/(&#x3112;o&#x3112;)/<del>/(&#x3112;o&#x3112;)/</del>/(&#x3112;o&#x3112;)/~~</p>
</span>
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/毕设/" rel="tag">#毕设</a>
          
            <a href="/tags/流水账/" rel="tag">#流水账</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/21/AngularJS学习笔记之依赖注入/" rel="next" title="AngularJS学习笔记之依赖注入">
                <i class="fa fa-chevron-left"></i> AngularJS学习笔记之依赖注入
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/04/15/记毕设中期/" rel="prev" title="记毕设中期">
                记毕设中期 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


        </div>

        


        
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/03/12/记毕设开题/"
           data-title="记毕设开题" data-url="http://yoursite.com/2016/03/12/记毕设开题/">
      </div>
    
  </div>


      </div>

      
        
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" src="http://img007.hc360.cn/g6/M00/F3/0B/wKhQr1NUf1WEVQivAAAAAICaJj0933.jpg" alt="YeChen" itemprop="image"/>
          <p class="site-author-name" itemprop="name">YeChen</p>
        </div>
        <p class="site-description motion-element" itemprop="description">咬定前端不放松</p>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">11</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          <div class="site-state-item site-state-categories">
            <a href="/categories">
              <span class="site-state-item-count">6</span>
              <span class="site-state-item-name">分类</span>
              </a>
          </div>

          <div class="site-state-item site-state-tags">
            
              <span class="site-state-item-count">7</span>
              <span class="site-state-item-name">标签</span>
              
          </div>

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/hellomrbigshot" target="_blank">
                  
                    <i class="fa fa-globe"></i> github
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/Mrbigbigshot" target="_blank">
                  
                    <i class="fa fa-globe"></i> twitter
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/Mrbigshotday" target="_blank">
                  
                    <i class="fa fa-globe"></i> weibo
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


      
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="icon-next-heart fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">YeChen</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  

  
    

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"yechen"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>
    
     


    
  

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>
  <script type="text/javascript" src="/js/fancy-box.js?v=0.4.5.2"></script>


  <script type="text/javascript" src="/js/helpers.js?v=0.4.5.2"></script>
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>
<script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

<script type="text/javascript" src="/js/motion.js?v=0.4.5.2" id="motion.global"></script>


  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  
<script type="text/javascript" src="/js/bootstrap.scrollspy.js?v=0.4.5.2" id="bootstrap.scrollspy.custom"></script>


<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    motionMiddleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');
      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          displaySidebar();
        }
      }
    };
  });
</script>



  <script type="text/javascript" src="/js/bootstrap.js"></script>

  
  

  
  

</body>
</html>
