<!doctype html>
<html class="theme-next   use-motion ">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.4.5.2" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="毕设," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.4.5.2" />






<meta name="description" content="&amp;#x9996;&amp;#x5148;&amp;#x5206;&amp;#x4EAB;&amp;#x6211;&amp;#x7684;&amp;#x6BD5;&amp;#x8BBE;&amp;#x6B4C;&amp;#x5355;&amp;#x5427;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5E9F;&amp;#x8BDD;&amp;#xFF0C;&amp;#x76F4;&amp;#x63A5;&amp;#x4E0A;&amp;#x3002;">
<meta property="og:type" content="article">
<meta property="og:title" content="毕设完成后的一些想法">
<meta property="og:url" content="http://yoursite.com/2016/05/20/毕设完成后的一些想法/index.html">
<meta property="og:site_name" content="My Blog">
<meta property="og:description" content="&amp;#x9996;&amp;#x5148;&amp;#x5206;&amp;#x4EAB;&amp;#x6211;&amp;#x7684;&amp;#x6BD5;&amp;#x8BBE;&amp;#x6B4C;&amp;#x5355;&amp;#x5427;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5E9F;&amp;#x8BDD;&amp;#xFF0C;&amp;#x76F4;&amp;#x63A5;&amp;#x4E0A;&amp;#x3002;">
<meta property="og:updated_time" content="2016-05-20T17:16:13.267Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="毕设完成后的一些想法">
<meta name="twitter:description" content="&amp;#x9996;&amp;#x5148;&amp;#x5206;&amp;#x4EAB;&amp;#x6211;&amp;#x7684;&amp;#x6BD5;&amp;#x8BBE;&amp;#x6B4C;&amp;#x5355;&amp;#x5427;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5E9F;&amp;#x8BDD;&amp;#xFF0C;&amp;#x76F4;&amp;#x63A5;&amp;#x4E0A;&amp;#x3002;">



<script type="text/javascript" id="hexo.configuration">
  var CONFIG = {
    scheme: 'Mist',
    sidebar: 'always',
    motion: true
  };
</script>

  <title> 毕设完成后的一些想法 | My Blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  <!--[if lte IE 8]>
  <div style=' clear: both; height: 59px; padding:0 0 0 15px; position: relative;margin:0 auto;'>
    <a href="http://windows.microsoft.com/en-US/internet-explorer/products/ie/home?ocid=ie6_countdown_bannercode">
      <img src="http://7u2nvr.com1.z0.glb.clouddn.com/picouterie.jpg" border="0" height="42" width="820"
           alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today or use other browser ,like chrome firefox safari."
           style='margin-left:auto;margin-right:auto;display: block;'/>
    </a>
  </div>
<![endif]-->
  



  <script type="text/javascript">
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?e2cf033f430366884a7f6855e095fa8a";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>




  <div class="container one-column page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">My Blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Walk steps step by step</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu menu-left">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-th fa-fw"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-guestbook">
          <a href="/guestbook" rel="section">
            
              <i class="menu-item-icon fa fa-question-circle fa-fw"></i> <br />
            
            留言
          </a>
        </li>
      

      
      
    </ul>
  

  
    <div class="site-search">
      
  
  <form class="site-search-form">
    <input type="text" id="st-search-input" class="st-search-input st-default-search-input" />
  </form>


<script type="text/javascript">
  (function(w,d,t,u,n,s,e){w['SwiftypeObject']=n;w[n]=w[n]||function(){
    (w[n].q=w[n].q||[]).push(arguments);};s=d.createElement(t);
    e=d.getElementsByTagName(t)[0];s.async=1;s.src=u;e.parentNode.insertBefore(s,e);
  })(window,document,'script','//s.swiftypecdn.com/install/v2/st.js','_st');

  _st('install', 'WSxrm3jXEy4o7v-t9_Bo','2.0.0');
</script>



    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div id="content" class="content">
          

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                毕设完成后的一些想法
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            发表于
            <time itemprop="dateCreated" datetime="2016-05-20T23:53:30+08:00" content="2016-05-20">
              2016-05-20
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp; 分类于
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/与技术无关/" itemprop="url" rel="index">
                    <span itemprop="name">与技术无关</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/05/20/毕设完成后的一些想法/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/05/20/毕设完成后的一些想法/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

        </div>
      </header>
    


    <div class="post-body">

      
      

      
        <span itemprop="articleBody"><p>&#x9996;&#x5148;&#x5206;&#x4EAB;&#x6211;&#x7684;&#x6BD5;&#x8BBE;&#x6B4C;&#x5355;&#x5427;&#xFF0C;&#x4E0D;&#x5E9F;&#x8BDD;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;&#x3002;<br><a id="more"></a></p>
<iframe frameborder="no" auto="0" border="0" marginwidth="0" marginheight="0" width="330" height="450" src="http://music.163.com/outchain/player?type=0&amp;id=382096027&amp;auto=1&amp;height=430"></iframe>

<p>&#x4F60;&#x6CA1;&#x6709;&#x770B;&#x9519;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x6BD5;&#x8BBE;&#x671F;&#x95F4;&#x4E00;&#x76F4;&#x542C;&#x7684;&#x6B4C;&#x5355;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x771F;&#x7684;&#x5047;&#x7684;&#xFF0C;&#x6709;&#x8FD9;&#x4E48;&#x60E8;&#xFF1F;&#x6709;&#x8FD9;&#x4E48;&#x60E8;&#x8FD8;&#x6709;&#x65F6;&#x95F4;&#x542C;&#x6B4C;&#xFF1F;&#x6211;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x662F;&#x6211;&#x665A;&#x4E0A;&#x7761;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x542C;&#x7684;&#x5417;&#xFF01;</p>
<p>&#x597D;&#x5427;&#x786E;&#x5B9E;&#x6709;&#x70B9;&#x5938;&#x5F20;&#x4E86;&#xFF0C;&#x6BD5;&#x8BBE;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x60E8;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x82E6;&#x903C;&#x3002;&#x4E2A;&#x4EBA;&#x611F;&#x89C9;&#x5927;&#x56DB;&#x4E0B;&#x5B66;&#x671F;&#x5E94;&#x8BE5;&#x7B97;&#x5927;&#x5B66;&#x56DB;&#x5E74;&#x751F;&#x6DAF;&#x4E2D;&#x6700;&#x8F9B;&#x82E6;&#x7684;&#x4E00;&#x6BB5;&#x65E5;&#x5B50;&#x4E86;&#xFF0C;&#x611F;&#x89C9;&#x9664;&#x4E86;&#x5468;&#x672B;&#x6BCF;&#x5929;&#x81F3;&#x5C11;&#x5F80;&#x5B9E;&#x9A8C;&#x5BA4;&#x8DD1;&#x4E24;&#x904D;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x65F6;&#x5019;&#x770B;&#x4E0D;&#x5230;&#x5E0C;&#x671B;&#x3002;</p>
<p>&#x6211;&#x73B0;&#x5728;&#x9047;&#x5230;&#x719F;&#x4EBA;&#x5C31;&#x548C;&#x4ED6;&#x4EEC;&#x62B1;&#x6028;&#x505A;&#x786C;&#x4EF6;&#x591A;&#x5C11;&#x591A;&#x5C11;&#x82E6;&#x903C;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x8BF4;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x786E;&#x5B9E;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x505A;&#x786C;&#x4EF6;&#xFF0C;&#x600E;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x8BA9;&#x4EBA;&#x5F88;&#x65E0;&#x8BED;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x5728;&#x8C03;&#x4E00;&#x5757;&#x7535;&#x8DEF;&#x677F;&#xFF0C;&#x6162;&#x6162;&#x8C03;&#x7740;&#x53C2;&#x6570;&#x7684;&#x65F6;&#x5019;&#x5FFD;&#x7136;&#x7535;&#x8DEF;&#x677F;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#x3002;&#x8FD9;&#x4E0B;&#x597D;&#x4E86;&#xFF0C;&#x6709;&#x7684;&#x5FD9;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x7528;&#x7535;&#x6E90;&#x548C;&#x793A;&#x6CE2;&#x5668;&#x52A0;&#x4E0A;&#x4E07;&#x7528;&#x8868;&#x5BF9;&#x4E00;&#x4E2A;&#x4E2A;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;DC-DC&#x7A33;&#x538B;&#x6A21;&#x5757;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x5355;&#x7247;&#x673A;&#x8F93;&#x51FA;&#x6A21;&#x5757;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x53D8;&#x538B;&#x5668;&#x6A21;&#x5757;&#x5462;&#xFF0C;&#x4E5F;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x90A3;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x91CD;&#x65B0;&#x6D4B;&#x91CF;&#x8BD5;&#x8BD5;&#xFF1F;&#x53C2;&#x6570;&#x8FD8;&#x662F;&#x4E0D;&#x5BF9;&#x5440;&#x3002;&#x90A3;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x7528;&#x4E07;&#x7528;&#x8868;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x5143;&#x5668;&#x4EF6;&#x6D4B;&#x8FC7;&#x53BB;&#x5457;&#xFF0C;&#x770B;&#x770B;&#x7535;&#x963B;&#x7535;&#x5BB9;&#x6709;&#x6CA1;&#x6709;&#x65AD;&#x8DEF;&#x77ED;&#x8DEF;&#x3002;&#x7136;&#x540E;&#x4E09;&#x56DB;&#x4E2A;&#x5C0F;&#x65F6;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6D4B;&#x5B8C;&#x4E86;&#x8FD8;&#x662F;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x96BE;&#x9053;&#x53D8;&#x538B;&#x5668;&#x65AD;&#x8DEF;&#x4E86;&#xFF1F;&#x4E07;&#x7528;&#x8868;&#x6D4B;&#x91CF;&#x663E;&#x793A;&#x901A;&#x8DEF;&#x5440; &#x3002;&#x6CA1;&#x529E;&#x6CD5;&#x4E86;&#xFF0C;&#x53EA;&#x80FD;&#x628A;&#x53D8;&#x538B;&#x5668;&#x5148;&#x5F04;&#x4E0B;&#x6765;&#x770B;&#x770B;&#x5185;&#x90E8;&#x6709;&#x6CA1;&#x6709;&#x70E7;&#x574F;&#x3002;&#x7ED3;&#x679C;&#x5F04;&#x4E0B;&#x6765;&#x4E00;&#x6D4B;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x2026;&#x2026;&#x3002;&#x4E4B;&#x540E;&#x53EA;&#x80FD;&#x518D;&#x628A;&#x53D8;&#x538B;&#x5668;&#x710A;&#x63A5;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x518D;&#x6D4B;&#x4E00;&#x904D;&#xFF0C;&#x7ED3;&#x679C;&#x597D;&#x4E86;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x4E94;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x8DCC;&#x8DCC;&#x649E;&#x649E;&#x7ED5;&#x4E86;&#x4E00;&#x5927;&#x5708;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x50CF;&#x4E0A;&#x4E00;&#x6BB5;&#x63CF;&#x8FF0;&#x7684;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x5728;&#x8C03;&#x8BD5;&#x6211;&#x7684;&#x7535;&#x8DEF;&#x677F;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#x8FC7;&#x4E0D;&#x4E0B;&#x4E09;&#x6B21;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x8010;&#x6027;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x597D;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x771F;&#x7684;&#x957F;&#x5927;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x521A;&#x521A;&#x8BF4;&#x7684;&#x90FD;&#x662F;&#x9898;&#x5916;&#x8BDD;&#x4E86;&#xFF0C;&#x6211;&#x65E2;&#x7136;&#x628A;&#x9898;&#x76EE;&#x53D6;&#x4E3A;&#x6BD5;&#x8BBE;&#x5B8C;&#x6210;&#x540E;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#xFF0C;&#x90A3;&#x8BF4;&#x660E;&#x6211;&#x6BD5;&#x8BBE;&#x80AF;&#x5B9A;&#x662F;&#x505A;&#x5B8C;&#x4E86;&#x561B;&#x3002;</p>
<p>&#x786E;&#x5B9E;&#xFF0C;&#x6211;&#x7684;&#x6BD5;&#x8BBE;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x65E0;&#x8BBA;&#x662F;&#x5B66;&#x957F;&#x8FD8;&#x662F;&#x8001;&#x5E08;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x5728;&#x6211;&#x7684;&#x65B9;&#x6848;&#x4E0A;&#x518D;&#x7ED9;&#x6211;&#x52A0;&#x4EFB;&#x52A1;&#x4E86;&#x3002;&#x5F00;&#x9898;&#x7684;&#x65F6;&#x5019;&#x8001;&#x5B8B;&#x548C;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x505A;&#x7684;&#x8FD9;&#x4E2A;&#x9A71;&#x52A8;&#x5440;&#xFF0C;&#x80FD;&#x8BA9;&#x8D85;&#x58F0;&#x7535;&#x673A;&#x8F6C;&#x8D77;&#x6765;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6211;&#x5728;&#x4E0A;&#x5468;&#x4E8C;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x5427;&#x3002;&#x7136;&#x540E;&#x8001;&#x9EC4;&#x53C8;&#x548C;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x8FD9;&#x6837;&#x4E0D;&#x884C;&#x5440;&#xFF0C;&#x4F60;&#x8981;&#x505A;&#x4E2A;&#x8C03;&#x901F;&#x7684;&#x529F;&#x80FD;&#x3002;&#x597D;&#x5417;&#xFF0C;&#x8C03;&#x901F;&#x4E5F;&#x7B80;&#x5355;&#xFF0C;&#x524D;&#x4E24;&#x5929;&#x8C03;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x603B;&#x5171;&#x4E5F;&#x624D;&#x82B1;&#x4E86;&#x4E00;&#x5929;&#x4E0D;&#x5230;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x4E4B;&#x540E;&#x5B66;&#x957F;&#x53C8;&#x548C;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x518D;&#x53BB;&#x505A;&#x4E2A;&#x80FD;&#x5B9E;&#x73B0;&#x53CD;&#x8F6C;&#x7684;&#x529F;&#x80FD;&#x5427;&#x3002;&#x8FD9;&#x4E2A;&#x4E5F;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x5355;&#x7247;&#x673A;&#x7F16;&#x7A0B;&#x561B;&#xFF0C;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5C31;&#x6210;&#x529F;&#x4E86;&#x3002;&#x8FD9;&#x65F6;&#x5B66;&#x957F;&#x548C;&#x6211;&#x8BF4;&#xFF0C;&#x4F60;&#x7684;&#x6BD5;&#x8BBE;&#x5706;&#x6EE1;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x7684;PCB&#x662F;&#x5B9A;&#x5236;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x7535;&#x8DEF;&#x677F;&#x505A;&#x597D;&#x540E;&#x57FA;&#x672C;&#x4E0D;&#x80FD;&#x6539;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x518D;&#x8BA9;&#x6211;&#x52A0;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x7684;&#x529F;&#x80FD;&#x4E86;&#x3002;</p>
<p>&#x6BD5;&#x8BBE;&#x505A;&#x5B8C;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x91CD;&#x5FC3;&#x5C31;&#x8981;&#x653E;&#x5728;&#x4FEE;&#x6539;&#x8BBA;&#x6587;&#x4E0A;&#x9762;&#x3002;&#x65F6;&#x95F4;&#x4E5F;&#x6BD4;&#x8F83;&#x7D27;&#xFF0C;&#x6240;&#x4EE5;&#x8BF4;&#x5269;&#x4E0B;&#x7684;&#x65E5;&#x5B50;&#x4F30;&#x8BA1;&#x4E5F;&#x6BD4;&#x8F83;&#x5FD9;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5DEE;&#x4E0D;&#x591A;&#x53EF;&#x4EE5;&#x5BF9;&#x6574;&#x4E2A;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x603B;&#x7ED3;&#x4E86;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x505A;&#x6BD5;&#x8BBE;&#x4E00;&#x5B9A;&#x8981;&#x9009;&#x597D;&#x8001;&#x5E08;&#xFF0C;&#x9009;&#x597D;&#x9898;&#x76EE;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x70B9;&#x5B8C;&#x5168;&#x6BD4;&#x4F60;&#x4ED8;&#x51FA;&#x591A;&#x5C11;&#x53BB;&#x505A;&#x6BD5;&#x8BBE;&#x91CD;&#x8981;&#x3002;&#x9009;&#x597D;&#x4E86;&#x8001;&#x5E08;&#x548C;&#x9898;&#x76EE;&#xFF0C;&#x6BD5;&#x8BBE;&#x505A;&#x5F97;&#x4E8B;&#x534A;&#x529F;&#x500D;&#xFF0C;&#x6BD5;&#x4E1A;&#x5B63;&#x5C31;&#x50CF;&#x5728;&#x5EA6;&#x5047;&#x3002;&#x6CA1;&#x9009;&#x597D;&#xFF0C;&#x90A3;&#x5C31;&#x5F97;&#x50CF;&#x6211;&#x8FD9;&#x6837;&#xFF0C;&#x8FC7;&#x5F97;&#x548C;&#x7814;&#x7A76;&#x751F;&#x4E00;&#x6837;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x5C3D;&#x91CF;&#x65E9;&#x5730;&#x53BB;&#x505A;&#x5B8C;&#x6BD5;&#x8BBE;&#xFF0C;&#x4E0D;&#x8981;&#x6700;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8D76;&#x8FDB;&#x5EA6;&#x3002;&#x5F53;&#x4F60;&#x6700;&#x540E;&#x624D;&#x6765;&#x505A;&#x6BD5;&#x8BBE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x53D1;&#x73B0;&#x6BD5;&#x8BBE;&#x6CA1;&#x4F60;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6765;&#x4E0D;&#x53CA;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x4EBA;&#x5F80;&#x5F80;&#x5BB9;&#x6613;&#x5954;&#x6E83;&#x3002;&#x6BD5;&#x8BBE;&#x505A;&#x4E0D;&#x5B8C;&#x5EF6;&#x6BD5;&#x4EC0;&#x4E48;&#x7684;&#x90FD;&#x7B97;&#x8F7B;&#x7684;&#xFF0C;&#x8981;&#x662F;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x53D7;&#x4E0D;&#x4E86;&#x6253;&#x51FB;&#x60F3;&#x6765;&#x4E2A;&#x4E00;&#x4E86;&#x767E;&#x4E86;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x80FD;&#x5199;&#x8BBA;&#x6587;&#x5C3D;&#x91CF;&#x5199;&#x8BBA;&#x6587;&#xFF0C;&#x522B;&#x505A;&#x6BD5;&#x8BBE;&#xFF0C;&#x5DE5;&#x79D1;&#x751F;&#x80FD;&#x505A;&#x8F6F;&#x4EF6;&#x5C3D;&#x91CF;&#x505A;&#x8F6F;&#x4EF6;&#xFF0C;&#x522B;&#x53BB;&#x778E;&#x641E;&#x4EC0;&#x4E48;&#x786C;&#x4EF6;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x662F;&#x5565;&#x5927;&#x725B;&#x3002;&#x8F6F;&#x4EF6;&#x7684;&#x642D;&#x5EFA;&#x90FD;&#x662F;&#x5C42;&#x5C42;&#x9012;&#x8FDB;&#x7684;&#xFF0C;&#x4F60;&#x8981;&#x662F;&#x4E0A;&#x65B9;&#x642D;&#x5EFA;&#x9519;&#x8BEF;&#x8FD8;&#x80FD;&#x62C6;&#x4E86;&#x91CD;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x8F6F;&#x4EF6;&#x51FA;&#x9519;&#x8FD8;&#x80FD;&#x6539;&#x3002;&#x505A;&#x786C;&#x4EF6;&#x51FA;&#x9519;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8981;&#x5B9A;&#x5236;&#x4EA7;&#x54C1;&#x7684;&#xFF0C;&#x5C31;&#x8981;&#x63A8;&#x5230;&#x91CD;&#x6765;&#xFF0C;&#x8D39;&#x8D22;&#x8D39;&#x529B;&#x3002;&#x8FD8;&#x6709;&#x50CF;&#x6211;&#x4EEC;&#x8C03;&#x8BD5;&#x7535;&#x8DEF;&#x677F;&#x7684;&#xFF0C;&#x4E0D;&#x6015;&#x8C03;&#x4E0D;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x6015;&#x8C03;&#x574F;&#x4E86;&#x7535;&#x8DEF;&#x677F;&#x3002;&#x4E07;&#x4E00;&#x677F;&#x4E0A;&#x5565;&#x5668;&#x4EF6;&#x70E7;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x67E5;&#x8FC7;&#x53BB;&#xFF0C;&#x65F6;&#x95F4;&#x82B1;&#x4E86;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD8;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x67E5;&#x51FA;&#x9519;&#x8BEF;&#x6765;&#x3002;</p>
<p>&#x5468;&#x4E94;&#x7684;&#x65F6;&#x5019;&#x5B66;&#x957F;&#x548C;&#x8001;&#x9EC4;&#x53BB;&#x5357;&#x822A;&#x51FA;&#x5DEE;&#x4E86;&#xFF0C;&#x5E26;&#x7740;&#x6211;&#x505A;&#x597D;&#x7684;&#x90A3;&#x5757;&#x677F;&#x5B50;&#x3002;&#x6211;&#x79BB;&#x6BD5;&#x4E1A;&#x4E5F;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x8FD1;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x5929;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5565;&#x6B63;&#x4E8B;&#x90FD;&#x6CA1;&#x505A;&#xFF0C;&#x4E0B;&#x5348;&#x548C;&#x670B;&#x53CB;&#x53BB;&#x770B;&#x4E86;&#x573A;&#x7535;&#x5F71;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x8D85;&#x5E02;&#x4E70;&#x4E86;&#x4E00;&#x6253;&#x5564;&#x9152;&#x3002;&#x665A;&#x4E0A;&#x5C31;&#x5728;&#x90A3;&#x513F;&#x5237;&#x5237;&#x5FAE;&#x4FE1;&#x3001;&#x5FAE;&#x535A;&#xFF0C;&#x559D;&#x559D;&#x9152;&#xFF0C;&#x770B;&#x770B;&#x89C6;&#x9891;&#x5565;&#x7684;&#x3002;&#x653E;&#x677E;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x8212;&#x670D;&#x6B7B;&#x4E86;&#x3002;</p>
<p>&#x6BD5;&#x8BBE;&#x505A;&#x5B8C;&#x4E86;&#xFF0C;&#x4F30;&#x8BA1;&#x8FD8;&#x8981;&#x63A5;&#x4E00;&#x4E9B;&#x5B66;&#x957F;&#x90A3;&#x8FB9;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x90A3;&#x5929;&#x6211;&#x5728;&#x8C03;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x5B66;&#x957F;&#x548C;&#x5B66;&#x59D0;&#x5C31;&#x8BF4;&#xFF0C;&#x5B66;&#x5F1F;&#x5440;&#xFF0C;&#x4F60;&#x5728;&#x5B8B;&#x8001;&#x5E08;&#x8FD9;&#x8FB9;&#x8BFB;&#x4E2A;&#x7814;&#x5457;&#x3002;&#x6211;&#x4E00;&#x542C;&#x6025;&#x5FD9;&#x6447;&#x5934;&#xFF0C;&#x8BF4;&#x624D;&#x4E0D;&#x8981;&#xFF0C;&#x592A;&#x714E;&#x71AC;&#x4E86;&#x3002;&#x786E;&#x5B9E;&#xFF0C;&#x505A;&#x5B8C;&#x8FD9;&#x4E2A;&#xFF0C;&#x5C31;&#x8981;&#x653E;&#x5F03;&#x786C;&#x4EF6;&#x4E86;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x51E0;&#x5E74;&#x540E;&#x600E;&#x6837;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x73B0;&#x5728;&#x5BF9;&#x786C;&#x4EF6;&#x662F;&#x6DF1;&#x6076;&#x75DB;&#x7EDD;&#x3002;</p>
<p>&#x591C;&#x6DF1;&#x4E86;&#xFF0C;&#x4E5F;&#x559D;&#x4E86;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x9152;&#xFF0C;&#x7761;&#x89C9;&#x5566;&#xFF0C;&#x665A;&#x5B89;&#x5566;&#x3002;</p>
<p>&#x6700;&#x540E;&#x518D;&#x8D34;&#x4E00;&#x9996;&#x6D41;&#x6D6A;&#x8BB0;&#xFF0C;&#x8D85;&#x597D;&#x542C;&#x7684;&#x3002;</p>
<embed src="http://www.xiami.com/widget/0_116025/singlePlayer.swf" auto="0" type="application/x-shockwave-flash" width="257" height="33" wmode="transparent"></span>
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/毕设/" rel="tag">#毕设</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/04/22/Canvas初学笔记/" rel="next" title="Canvas初学笔记">
                <i class="fa fa-chevron-left"></i> Canvas初学笔记
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/11/28/git指令快速入门/" rel="prev" title="git指令快速入门">
                git指令快速入门 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


        </div>

        


        
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/05/20/毕设完成后的一些想法/"
           data-title="毕设完成后的一些想法" data-url="http://yoursite.com/2016/05/20/毕设完成后的一些想法/">
      </div>
    
  </div>


      </div>

      
        
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" src="http://img007.hc360.cn/g6/M00/F3/0B/wKhQr1NUf1WEVQivAAAAAICaJj0933.jpg" alt="YeChen" itemprop="image"/>
          <p class="site-author-name" itemprop="name">YeChen</p>
        </div>
        <p class="site-description motion-element" itemprop="description">咬定前端不放松</p>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">18</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          <div class="site-state-item site-state-categories">
            <a href="/categories">
              <span class="site-state-item-count">6</span>
              <span class="site-state-item-name">分类</span>
              </a>
          </div>

          <div class="site-state-item site-state-tags">
            
              <span class="site-state-item-count">12</span>
              <span class="site-state-item-name">标签</span>
              
          </div>

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/hellomrbigshot" target="_blank">
                  
                    <i class="fa fa-globe"></i> github
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://twitter.com/Mrbigbigshot" target="_blank">
                  
                    <i class="fa fa-globe"></i> twitter
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/Mrbigshotday" target="_blank">
                  
                    <i class="fa fa-globe"></i> weibo
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


      
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="icon-next-heart fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">YeChen</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  

  
    

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"yechen"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>
    
     


    
  

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>
  <script type="text/javascript" src="/js/fancy-box.js?v=0.4.5.2"></script>


  <script type="text/javascript" src="/js/helpers.js?v=0.4.5.2"></script>
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>
<script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

<script type="text/javascript" src="/js/motion.js?v=0.4.5.2" id="motion.global"></script>


  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  
<script type="text/javascript" src="/js/bootstrap.scrollspy.js?v=0.4.5.2" id="bootstrap.scrollspy.custom"></script>


<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    motionMiddleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');
      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          displaySidebar();
        }
      }
    };
  });
</script>



  <script type="text/javascript" src="/js/bootstrap.js"></script>

  
  

  
  

</body>
</html>
